In [57]:
! pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\ead\desktop\tarde_exercicio_jp\.venv\lib\site-packages (2.0.31)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\ead\desktop\tarde_exercicio_jp\.venv\lib\site-packages (from sqlalchemy) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\ead\desktop\tarde_exercicio_jp\.venv\lib\site-packages (from sqlalchemy) (3.0.3)

[notice] A new release of pip is available: 24.1.2 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [58]:
! pip install pandas

Requirement already satisfied: pandas in c:\users\ead\desktop\tarde_exercicio_jp\.venv\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\ead\desktop\tarde_exercicio_jp\.venv\lib\site-packages (from pandas) (2.0.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\ead\desktop\tarde_exercicio_jp\.venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\ead\desktop\tarde_exercicio_jp\.venv\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\ead\desktop\tarde_exercicio_jp\.venv\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\ead\desktop\tarde_exercicio_jp\.venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

[notice] A new release of pip is available: 24.1.2 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [59]:
import pandas as pd

In [60]:
# Módulo
from sqlalchemy import create_engine

In [61]:
! pip install pymysql

Requirement already satisfied: pymysql in c:\users\ead\desktop\tarde_exercicio_jp\.venv\lib\site-packages (1.1.1)

[notice] A new release of pip is available: 24.1.2 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [62]:
# definir as credenciais
import pymysql
import urllib.parse
user = 'root'
password = urllib.parse.quote_plus('senai@123')
host = 'localhost'
database = 'projetodiario1'
# criar uma url de conexão 
connection_string = f'mysql+pymysql://{user}:{password}@{host}/{database}'
# criar a conexão com o create_engine()
engine = create_engine(connection_string)
# escrever uma consulta SQL 
query_alunos = "SELECT * FROM aluno"
# criar o dataframe
df_alunos = pd.read_sql(query_alunos,engine)
# mostrar os cinco primeiros 
df_alunos.head()

   id        ra  Nome  tempoestudo  rendafamiliar
0   1  12345678  None            0            NaN
1   2  12345679  None            0            NaN
2   3  12345680  None            0            NaN
3   4  12345681  None            0            NaN
4   5  12345682  None            0            NaN

#Quais bibliotescas um cientista de dados utiliza?
 - Pandas
 - Numpy
 - Fundamentos de IA (Scikit-Learn)

- Material Didátivo 
- Pandas e NumPy (Notebook)
- Scikit-Learn : elaboração de modelos de IA
- NumPy: Matemática 

05/08/2024

- Carregar dados (ok)

- Salvar um dataframe

In [63]:
csv_filename = 'aluno.csv'
df_alunos.to_csv(csv_filename,index=False)

# Eu salveio o dataframe!

# Salve o Dataframe no formato JSON

In [64]:
json_filename = 'aluno.json'
df_alunos.to_json(json_filename,index=False)

In [65]:
! pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\ead\desktop\tarde_exercicio_jp\.venv\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\users\ead\desktop\tarde_exercicio_jp\.venv\lib\site-packages (from openpyxl) (1.1.0)

[notice] A new release of pip is available: 24.1.2 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [66]:
csv_filename = 'planilha_alunos.xlsx'
df_alunos.to_excel(csv_filename,index=False)

In [67]:
df_alunos.columns

Index(['id', 'ra', 'Nome', 'tempoestudo', 'rendafamiliar'], dtype='object')

In [68]:
df_tempo_renda = df_alunos[['tempoestudo','rendafamiliar']]
df_tempo_renda

    tempoestudo  rendafamiliar
0             0            NaN
1             0            NaN
2             0            NaN
3             0            NaN
4             0            NaN
..          ...            ...
87           18       117000.0
88           19       119000.0
89           17       121000.0
90           20       123000.0
91           16       125000.0

[92 rows x 2 columns]

# Tipos

In [69]:
print(type(df_tempo_renda))

<class 'pandas.core.frame.DataFrame'>

Crie um recurso para mostrar apenas uma coluna. Mostre qual o tipo desse recurso

In [70]:
serie_tempo_renda = df_tempo_renda['rendafamiliar']
type(serie_tempo_renda)

pandas.core.series.Series

Revisão Funções Básicas 
-  retorne o dataframe da ultima aula com as dias primeiras linhas como amostras

In [71]:
df_tempo_renda = df_alunos[['tempoestudo','rendafamiliar']]
df_tempo_renda
df_tempo_renda.head(2)

   tempoestudo  rendafamiliar
0            0            NaN
1            0            NaN

Exercicio agora retorne as duas ultimas linhas da amostra

In [72]:
df_tempo_renda = df_alunos[['tempoestudo','rendafamiliar']]
df_tempo_renda
df_tempo_renda.tail(2)

    tempoestudo  rendafamiliar
90           20       123000.0
91           16       125000.0

retorne uma tupla com número de linhas e colunas ( usa a shape)

In [73]:
df_tempo_renda = df_alunos[['tempoestudo','rendafamiliar']]
df_tempo_renda
df_tempo_renda.shape

(92, 2)

Exercicio 04 retorne as informações gerasis do dataframe

In [74]:
df_tempo_renda = df_alunos[['tempoestudo','rendafamiliar']]
df_tempo_renda
df_tempo_renda.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 92 entries, 0 to 91
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tempoestudo    92 non-null     int64
 1   rendafamiliar  65 non-null     float64
dtypes: float64(1), int64(1)
memory usage: 1.6 KB

retorne as colunas

In [75]:
qtde = len(df_tempo_renda)
if qtde <= 92:
    print(f"quantidade:{qtde} dentro do ideal")

quantidade:92 dentro do ideal

retorne as colunas

In [76]:
df_tempo_renda.columns

Index(['tempoestudo', 'rendafamiliar'], dtype='object')

retorne as colunas rendafamiliar  ( usar as colonas e chama o info )

In [77]:
df_tempo_renda['rendafamiliar'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 92 entries, 0 to 91
Series name: rendafamiliar
Non-Null Count  Dtype
--------------  -----
65 non-null     float64
dtypes: float64(1)
memory usage: 868.0 bytes

# Mostre os tipos com dtypes

In [78]:
df_alunos.dtypes

id                 int64
ra                object
Nome              object
tempoestudo        int64
rendafamiliar    float64
dtype: object

Describre serve para mostrar a visão stastitica

In [79]:
df_alunos.describe()

               id  tempoestudo  rendafamiliar
count   92.000000    92.000000      65.000000
mean   291.228261    10.902174   60749.230769
std    178.542087     7.751724   37943.539977
min      1.000000     0.000000    1800.000000
25%     29.750000     0.000000   27000.000000
50%    392.500000    14.000000   61000.000000
75%    415.250000    17.000000   93000.000000
max    438.000000    20.000000  125000.000000

Exercicio 8

In [80]:
query_diariobordo = 'SELECT * from diariobordo'

In [81]:
df_diariobordo = pd.read_sql(query_diariobordo,engine)

In [82]:
# separar as colunas 
df_diariobordo.head()

   id                            texto            datahora  fk_aluno_id
0   9                 a aula foi legal 2024-08-01 09:16:00           13
1  10          estou aprendendo insert 2024-08-01 09:33:00           24
2  11  estou aprendendo insert de novo 2024-08-01 09:33:00           24
3  12                 a aula foi legal 2024-08-01 09:16:00           13
4  13          estou aprendendo insert 2024-08-01 09:33:00           24

In [83]:
df_diariobordo.describe()

              id                       datahora  fk_aluno_id
count  39.000000                             39    39.000000
mean   28.000000  2024-08-01 09:27:20.000000256    20.333333
min     9.000000            2024-08-01 09:16:00    13.000000
25%    18.500000            2024-08-01 09:16:00    13.000000
50%    28.000000            2024-08-01 09:33:00    24.000000
75%    37.500000            2024-08-01 09:33:00    24.000000
max    47.000000            2024-08-01 09:33:00    24.000000
std    11.401754                            NaN     5.253236

Faça um JOIN no pandas simular ao do SQL

# fatiamento é []

In [86]:
df_diariobordo[5:10]

   id                            texto            datahora  fk_aluno_id
5  14  estou aprendendo insert de novo 2024-08-01 09:33:00           24
6  15                 a aula foi legal 2024-08-01 09:16:00           13
7  16          estou aprendendo insert 2024-08-01 09:33:00           24
8  17  estou aprendendo insert de novo 2024-08-01 09:33:00           24
9  18                 a aula foi legal 2024-08-01 09:16:00           13

vamos fazer um join?
### PASSOS PARA O MERGE 

- Use o comando merge 
- Criar uma variável - resultado. 
- pd.merge(dataframe1,dataframe2,tipo_uniao,qual chave da esq, qual chave da dir) - queremos unir 
- qual o tipo de união: how='inner'
- O parâmetro how define o tipo de join que estamos realizando. 
- inner significa que queremos um join interno, o que resulta em apenas as linhas que têm correspondencia em ambos os DataFrames

In [90]:
# Realizar o Join
resultado = pd.merge(df_diariobordo, df_alunos, how='left',left_on='fk_aluno_id',right_on='id')

In [91]:
# Selecionar  as colunas desejadas
resultado_selecionado = resultado [['texto', 'datahora', 'ra']]

In [92]:
# Mostrar o resultado 
resultado_selecionado.head()

                             texto            datahora        ra
0                 a aula foi legal 2024-08-01 09:16:00  12345673
1          estou aprendendo insert 2024-08-01 09:33:00  12345685
2  estou aprendendo insert de novo 2024-08-01 09:33:00  12345685
3                 a aula foi legal 2024-08-01 09:16:00  12345673
4          estou aprendendo insert 2024-08-01 09:33:00  12345685

Crie uma junção do dataframe aluno com avaliação. Mostre as notas e o RA do Aluno

In [97]:
df_alunos.describe()

               id  tempoestudo  rendafamiliar
count   92.000000    92.000000      65.000000
mean   291.228261    10.902174   60749.230769
std    178.542087     7.751724   37943.539977
min      1.000000     0.000000    1800.000000
25%     29.750000     0.000000   27000.000000
50%    392.500000    14.000000   61000.000000
75%    415.250000    17.000000   93000.000000
max    438.000000    20.000000  125000.000000